# Добавление инструмента find_abbreviation_expansion с уникальными расшифровками

**Дата:** 2026-04-29  
**Номер:** 20260429.001  
**Модуль:** RAG/kb_tools.py  
**Тип изменения:** Новый функционал

---

## Краткое описание

Добавлен новый инструмент `find_abbreviation_expansion` для поиска расшифровки аббревиатур в базе знаний. Инструмент возвращает **список уникальных расшифровок** в виде строк вместо сырых regex-результатов.

---

## Что сделано

### 1. Новая Pydantic модель результата

```python
class AbbreviationExpansionResult(BaseModel):
    """Результат поиска расшифровки аббревиатуры"""
    abbreviation: str           # Исходная аббревиатура
    expansions: list[str]       # Уникальные найденные расшифровки
    total_found: int            # Всего найдено расшифровок
    pattern_used: str           # Использованный regex паттерн
```

**Пример результата:**
```json
{
  "abbreviation": "КЦОИ",
  "expansions": [
    "Корпоративный Центр Обработки Информации"
  ],
  "total_found": 1,
  "pattern_used": "К[а-яё]*\\s+Ц[а-яё]*\\s+О[а-яё]*\\s+И[а-яё]*"
}
```

### 2. Input модель

```python
class FindAbbreviationExpansionInput(BaseModel):
    abbreviation: str = Field(
        description="Abbreviation in CAPITAL LETTERS (e.g. 'КЦОИ', 'RAM', 'API')"
    )
    max_results: int = Field(default=50, ge=1, le=200)
```

### 3. Функция генерации regex паттерна

```python
def _build_abbreviation_pattern(abbreviation: str) -> str:
    r"""
    Создает regex паттерн для поиска расшифровки аббревиатуры.
    
    КЦОИ -> К[а-яё]*\s+Ц[а-яё]*\s+О[а-яё]*\s+И[а-яё]*
    RAM  -> R[a-z]*\s+A[a-z]*\s+M[a-z]*
    """
```

**Логика:**
- Определяет язык по первой букве (кириллица/латиница)
- Для каждой буквы генерирует `Буква[буквы]*`
- Соединяет через `\s+` (пробелы)

### 4. Инструмент с извлечением уникальных расшифровок

```python
@tool(args_schema=FindAbbreviationExpansionInput)
def find_abbreviation_expansion(
    abbreviation: str,
    max_results: int = 50
) -> AbbreviationExpansionResult:
    """Find expansions of abbreviations in knowledge base."""
```

**Ключевая логика:**
```python
# Извлекаем уникальные расшифровки
expansions_set = set()
for match in search_result.matches[:max_results]:
    # Нормализация пробелов
    expansion = " ".join(match.match.split())
    if expansion:
        expansions_set.add(expansion)

# Сортировка
unique_expansions = sorted(list(expansions_set))
```

### 5. Интеграция

- ✅ Добавлен в `ALL_TOOLS` (15 инструментов)
- ✅ Добавлен в `AGENT_SELECTABLE_TOOLS` (13 инструментов)
- ✅ Добавлен в `create_kb_tools()` return list
- ✅ Добавлен в `get_tool_registry()`
- ✅ Обновлен module docstring

### 6. Документация

Создан файл `RAG/docs/001_find_abbreviation_expansion.md` с описанием:
- Принцип работы
- Примеры использования
- API документация
- Сравнение с предыдущей версией
- Ограничения и улучшения

---

## Примеры использования

### Python API

```python
from kb_tools import create_kb_tools

tools = create_kb_tools(vectorstore, knowledge_dir)
find_abbr = next(t for t in tools if t.name == "find_abbreviation_expansion")

result = find_abbr.invoke({"abbreviation": "КЦОИ"})

print(f"Найдено {result.total_found} расшифровок:")
for expansion in result.expansions:
    print(f"  - {expansion}")
```

**Вывод:**
```
Найдено 1 расшифровок:
  - Корпоративный Центр Обработки Информации
```

### В LangChain Agent

Агент автоматически выбирает инструмент при запросах:
- "Что означает КЦОИ?"
- "Расшифруй RAM"
- "Полное название API"

---

## Технические детали

### Поддерживаемые языки

| Язык | Символы | Пример |
|------|---------|--------|
| Кириллица | А-Я, ё | КЦОИ, СУБД |
| Латиница | A-Z | RAM, API, CPU |

### Алгоритм работы

1. **Входные данные:** Аббревиатура (CAPITAL LETTERS)
2. **Генерация паттерна:** Каждая буква → начало слова + буквы + пробел
3. **Regex поиск:** Через существующий `regex_search` в .md файлах
4. **Извлечение уникальных:** Set для дедупликации
5. **Нормализация:** Очистка лишних пробелов
6. **Сортировка:** Алфавитный порядок
7. **Возврат:** Структурированный Pydantic объект

### Примеры паттернов

| Аббревиатура | Regex паттерн | Найдет |
|--------------|--------------|--------|
| `КЦОИ` | `К[а-яё]*\s+Ц[а-яё]*\s+О[а-яё]*\s+И[а-яё]*` | "Корпоративный Центр Обработки Информации" |
| `RAM` | `R[a-z]*\s+A[a-z]*\s+M[a-z]*` | "Random Access Memory" |
| `СУБД` | `С[а-яё]*\s+У[а-яё]*\s+Б[а-яё]*\s+Д[а-яё]*` | "Система Управления Базами Данных" |

---

## Преимущества

1. **Чистый результат**
   - Только уникальные расшифровки
   - Нет дубликатов
   - Нет лишних метаданных

2. **Автоматическая обработка**
   - Нормализация пробелов
   - Дедупликация
   - Алфавитная сортировка

3. **Удобство для агента**
   - Простой список строк
   - Легко использовать в промптах
   - Структурированный JSON

4. **Типизация**
   - Pydantic модель
   - Валидация данных
   - IDE autocomplete

5. **Автоматическая генерация паттернов**
   - Не нужно писать regex вручную
   - Поддержка двух языков
   - Простой API

---

## Изменения в коде

### Файлы изменены

- `RAG/kb_tools.py` - основной модуль (+130 строк)
- `RAG/docs/001_find_abbreviation_expansion.md` - документация (создан)

### Статистика

- **Добавлено строк:** ~130
- **Новых функций:** 2
- **Новых Pydantic моделей:** 2
- **Обновлено списков:** 4

### Тестирование

✅ Модуль импортируется без ошибок  
✅ Pydantic модель работает корректно  
✅ JSON сериализация/десериализация  
✅ Генерация паттернов для кириллицы  
✅ Генерация паттернов для латиницы  

---

## Отличия от первой версии

### Было (v1):
```python
def find_abbreviation_expansion(...) -> RegexSearchResult:
    # Возвращал RegexSearchResult с matches[]
    # Каждый match: file, line_number, matched_text, context
    # Дубликаты возможны
```

### Стало (v2):
```python
def find_abbreviation_expansion(...) -> AbbreviationExpansionResult:
    # Возвращает AbbreviationExpansionResult с expansions[]
    # Каждый expansion: просто строка
    # Дубликаты удалены, отсортировано
```

---

## Ограничения

- Аббревиатура должна быть заглавными буквами
- Все буквы одного языка (кириллица ИЛИ латиница)
- Между словами должен быть пробел
- Только буквенные символы (цифры не поддерживаются)

---

## Возможные улучшения (TODO)

1. **Смешанные языки**
   - Поддержка КЦOI (кириллица + латиница)

2. **Гибкие разделители**
   - Дефисы, слэши между словами
   - "КЦОИ" → "Корпоративный-Центр Обработки-Информации"

3. **Метаданные источников**
   - Добавить поле `sources: list[dict]` с файлами
   - Информация о частоте встречаемости

4. **Ранжирование**
   - По частоте в документации
   - По релевантности секции

5. **Нечеткий поиск**
   - Допуск на опечатки
   - Fuzzy matching

---

## Заключение

Инструмент `find_abbreviation_expansion` успешно интегрирован в систему и готов к использованию. Он предоставляет удобный API для поиска расшифровок аббревиатур с автоматической дедупликацией и нормализацией результатов.

**Следующие шаги:**
- Тестирование в реальных сценариях с агентом
- Сбор статистики использования
- Реализация улучшений по мере необходимости

